app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "name", "addr", "DOB", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save